---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraint
source: html/21c642f3-7aae-759b-4aac-ff4e2dd77d57.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraint

A dimension or other constraint that takes part in a RebarShapeDefinition.

## Syntax (C#)
```csharp
public class RebarShapeConstraint : IDisposable
```